#### DisciplineTypeId Members

---

|  |
| --- |
| DisciplineTypeId Class   Properties   See Also |

The  DisciplineTypeId  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | Architecture | Architecture. |
| Public property Static member | Common | Common. |
| Public property Static member | Electrical | Electrical. |
| Public property Static member | Energy | Energy. |
| Public property Static member | Hvac | HVAC. |
| Public property Static member | Infrastructure | Infrastructure. |
| Public property Static member | Piping | Piping. |
| Public property Static member | Structural | Structural. |

# See Also

DisciplineTypeId Class

Autodesk.Revit.DB Namespace